MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_recv.c
exit:
	return ret;
}


s32 rtw_recv_entry(union recv_frame *precvframe)
{
	_adapter *padapter;
	struct recv_priv *precvpriv;
	s32 ret = _SUCCESS;



	padapter = precvframe->u.hdr.adapter;

	precvpriv = &padapter->recvpriv;


	ret = recv_func(padapter, precvframe);
	if (ret == _FAIL) {
		goto _recv_entry_drop;
	}


	precvpriv->rx_pkts++;


	return ret;

_recv_entry_drop:

#ifdef CONFIG_MP_INCLUDED
	if (padapter->registrypriv.mp_mode == 1)
		padapter->mppriv.rx_pktloss = precvpriv->rx_drop;
#endif



	return ret;
}

#ifdef DBG_SERVING_AP_RSSI
static void rtw_signal_stat_dump_row_data(struct signal_stat *signal_stat)
{
	int i, s, l;
	u8 row[256];
	u8 avg[256];

	i = signal_stat->signal_row_idx ? (signal_stat->signal_row_idx - 1) : ROW_LEN - 1;

	if (signal_stat->signal_row[i] != 0) {
		memset (row, 0, sizeof(row));
		memset (avg, 0, sizeof(row));
		sprintf(row, "[ROW]");
		sprintf(avg, "[AVG]");

		s = 0;
		l = signal_stat->signal_row_idx;
		if (signal_stat->signal_row[signal_stat->signal_row_idx] != 0) {
			/* round-wrap */
			s = signal_stat->signal_row_idx + 1; /* next one is the 1'st entry */
			l = ROW_LEN;
		}

		for (i = 0; i < l; i++) {
			sprintf(row + strlen(row), " %2d", signal_stat->signal_row[(s+i)%ROW_LEN]);
			sprintf(avg + strlen(avg), " %2d", signal_stat->signal_avg[(s+i)%ROW_LEN]);

			if ((i+1)%16 == 0) {
				printk("%s\n%s\n", row, avg);
				memset (row, 0, sizeof(row));
				memset (avg, 0, sizeof(row));
				sprintf(row, "[ROW]");
				sprintf(avg, "[AVG]");
			}
		}

		if ((i)%16 != 0)
			printk("%s\n%s\n", row, avg);

		signal_stat->signal_row_idx = 0;
		memset (signal_stat->signal_row, 0, ROW_LEN);
		memset (signal_stat->signal_avg, 0, ROW_LEN);
	}
}
#endif

static void rtw_signal_stat_beacon(_adapter *adapter)
{
	struct recv_priv *recvpriv = &adapter->recvpriv;
	struct signal_stat *signal_stat = &recvpriv->signal_strength_beacon;

	u32 tmp_s, tmp_q;
	u8 avg_signal_strength = 0;
	u32 num_signal_strength = 0;
	u8 ratio_pre_stat = 0, ratio_curr_stat = 0, ratio_total = 0, ratio_profile = SIGNAL_STAT_CALC_PROFILE_0;

	if (signal_stat->update_req == 0) { /* update_req is clear, means we got rx */
		avg_signal_strength = signal_stat->avg_val;
		num_signal_strength = signal_stat->total_num;
		/* after avg_vals are accquired, we can re-stat the signal values */
		signal_stat->update_req = 1;
	}

	if (num_signal_strength == 0) {
		if (rtw_get_on_cur_ch_time(adapter) == 0
		    || rtw_get_passing_time_ms(rtw_get_on_cur_ch_time(adapter)) < 2 * adapter->mlmeextpriv.mlmext_info.bcn_interval
		   )
			return;
	}

	if ((check_fwstate(&adapter->mlmepriv, WIFI_ASOC_STATE) == _FALSE)
#ifndef CONFIG_SCAN_BACKOP
		|| (check_fwstate(&adapter->mlmepriv, WIFI_UNDER_SURVEY) == _TRUE)
#endif
	)
		return;

	if (adapter->registrypriv.mp_mode == 1)
		ratio_profile = SIGNAL_STAT_CALC_PROFILE_2;
	else if (RTW_SIGNAL_STATE_CALC_PROFILE < SIGNAL_STAT_CALC_PROFILE_MAX)
		ratio_profile = RTW_SIGNAL_STATE_CALC_PROFILE;

	ratio_pre_stat = signal_stat_calc_profile[ratio_profile][0];
	ratio_curr_stat = signal_stat_calc_profile[ratio_profile][1];
	ratio_total = ratio_pre_stat + ratio_curr_stat;

	/* update value of signal_strength, rssi, signal_qual */
	tmp_s = (ratio_curr_stat * avg_signal_strength + ratio_pre_stat * recvpriv->signal_strength);
	if (tmp_s % ratio_total)
		tmp_s = tmp_s / ratio_total + 1;
	else
		tmp_s = tmp_s / ratio_total;
	if (tmp_s > 100)
		tmp_s = 100;

#ifdef DBG_SERVING_AP_RSSI
	rtw_signal_stat_dump_row_data(signal_stat);
	RTW_INFO("%d + %d --> %d\n", recvpriv->beacon_strength, avg_signal_strength, tmp_s);
#endif
	recvpriv->beacon_strength = tmp_s;
	recvpriv->beacon_rssi = (s8)translate_percentage_to_dbm(tmp_s);
}

#ifdef CONFIG_NEW_SIGNAL_STAT_PROCESS
static void rtw_signal_stat_timer_hdl(void *ctx)
{
	_adapter *adapter = (_adapter *)ctx;
	struct recv_priv *recvpriv = &adapter->recvpriv;

	u32 tmp_s, tmp_q;
	u8 avg_signal_strength = 0;
	u8 avg_signal_qual = 0;
	u32 num_signal_strength = 0;
#ifdef DBG_RX_SIGNAL_DISPLAY_PROCESSING
	u32 num_signal_qual = 0;
#endif
	u8 ratio_pre_stat = 0, ratio_curr_stat = 0, ratio_total = 0, ratio_profile = SIGNAL_STAT_CALC_PROFILE_0;

	rtw_signal_stat_beacon(adapter);

	if (adapter->recvpriv.is_signal_dbg) {
		/* update the user specific value, signal_strength_dbg, to signal_strength, rssi */
		adapter->recvpriv.signal_strength = adapter->recvpriv.signal_strength_dbg;
		adapter->recvpriv.rssi = (s8)translate_percentage_to_dbm((u8)adapter->recvpriv.signal_strength_dbg);
	} else {

		if (recvpriv->signal_strength_data.update_req == 0) { /* update_req is clear, means we got rx */
			avg_signal_strength = recvpriv->signal_strength_data.avg_val;
			num_signal_strength = recvpriv->signal_strength_data.total_num;
			/* after avg_vals are accquired, we can re-stat the signal values */
			recvpriv->signal_strength_data.update_req = 1;
		}

		if (recvpriv->signal_qual_data.update_req == 0) { /* update_req is clear, means we got rx */
			avg_signal_qual = recvpriv->signal_qual_data.avg_val;
#ifdef DBG_RX_SIGNAL_DISPLAY_PROCESSING
			num_signal_qual = recvpriv->signal_qual_data.total_num;
#endif
			/* after avg_vals are accquired, we can re-stat the signal values */
			recvpriv->signal_qual_data.update_req = 1;
		}

		if (num_signal_strength == 0) {
			if (rtw_get_on_cur_ch_time(adapter) == 0
			    || rtw_get_passing_time_ms(rtw_get_on_cur_ch_time(adapter)) < 2 * adapter->mlmeextpriv.mlmext_info.bcn_interval
			   )
				goto set_timer;
		}

		if (check_fwstate(&adapter->mlmepriv, WIFI_UNDER_SURVEY) == _TRUE
		    || check_fwstate(&adapter->mlmepriv, WIFI_ASOC_STATE) == _FALSE
		   )
			goto set_timer;

#ifdef CONFIG_CONCURRENT_MODE
		if (rtw_mi_buddy_check_fwstate(adapter, WIFI_UNDER_SURVEY) == _TRUE)
			goto set_timer;
#endif
		if (adapter->registrypriv.mp_mode == 1)
			ratio_profile = SIGNAL_STAT_CALC_PROFILE_2;
		else if (RTW_SIGNAL_STATE_CALC_PROFILE < SIGNAL_STAT_CALC_PROFILE_MAX)
			ratio_profile = RTW_SIGNAL_STATE_CALC_PROFILE;

		ratio_pre_stat = signal_stat_calc_profile[ratio_profile][0];
		ratio_curr_stat = signal_stat_calc_profile[ratio_profile][1];
		ratio_total = ratio_pre_stat + ratio_curr_stat;

		/* update value of signal_strength, rssi, signal_qual */
		tmp_s = (ratio_curr_stat * avg_signal_strength + ratio_pre_stat * recvpriv->signal_strength);
		if (tmp_s % ratio_total)
			tmp_s = tmp_s / ratio_total + 1;
		else
			tmp_s = tmp_s / ratio_total;
		if (tmp_s > 100)
			tmp_s = 100;

